---
kind: property
id: P:Autodesk.Revit.DB.ParameterDownloadOptions.IsValidObject
source: html/f98e2784-611a-ff16-c1e7-4b9e545f31c5.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.